var CharacterInformations = [
    {
        Name : "Captain America",
        Info : "สตีเว่น โรเจอร์ส เป็นชายหนุ่มร่างกายบอบบางที่เข้ารับการทดลองลับในช่วงสงครามโลกครั้งที่สอง โดยเขาได้รับสารเซรุ่มทดลองซึ่งผลิตไว้ช่วยเสริมกำลังกองทัพสหรัฐอเมริกา และได้กลายเป็นมนุษย์ที่มีร่างกายสมบูรณ์แบบ",
        Casting : "Chris Evan",
        Movie : "Captain America: The First Avenger (2011) \nMarvel's The Avengers (2012) \nCaptain America: The Winter Soldier (2014) \nAvengers: Age of Ultron (2015) \nCaptain America: Civil War (2016) \nAvengers: Infinity War \nAvengers: Endgame" 
    },
    {
        Name : "Ironman",
        Info : "แอนโธนี่ เอ็ดเวิร์ด โทนี่ สตาร์ค เป็นลูกชายของ โฮเวิร์ด สตาร์ค เเละ มาเรีย สตาร์ค มหาเศรษฐีนักอุตสาหกรรมประธานบริษัท Stark Industries โทนี่เป็นเด็กอัจฉริยะ เขาเข้าเรียนที่ MIT สาขาวิศวกรรมไฟฟ้า เมื่ออายุแค่ 15 ปี และจบออกมาเมื่ออายุได้ 21 ปีเท่านั้น เขาได้รับมรดกทั้งหมดหลังจากที่พ่อเเม่ประสบอุบัติเหตุเสียชีวิต หลังจากขึ้นเป็นผู้นำบริษัท เขาได้นำ Stark En. เข้าสู่อุตสาหกรรมอาวุธสงครามซึ่งรวมไปถึงการพัฒนาชุดรบเพื่อเพิ่มความปลอดภัยและศักยภาพในการรบให้กับเหล่าทหาร",
        Casting : "Robert Downey Jr.",
        Movie : "Iron Man (2008) \nIron Man 2 (2010) \nMarvel's The Avengers (2012) \nAvengers: Age of Ultron (2015) \nCaptain America: Civil War (2016) \nSpider-Man: Homecoming \nAvengers: Infinity War \nAvengers: Endgame"
    },
    {
        Name : "Thor",
        Info : "เทพเจ้าสายฟ้าบุตรแห่ง Odin ผู้ปกครองเหล่าเทพเจ้าเเห่งดินเเดน Asgard เขาเติบโตมาพร้อมกับพี่น้องบุญธรรม Loki และได้รับมอบ Mjornir ค้อนแห่งเทพสายฟ้าจากบิดาของเขา ในช่วงวัยหนุ่มเขาเป็นเทพที่เจ้าอารมณ์ ใจร้อน หัวรุนแรง และกระหายชัยชนะโอดินเห็นว่าควรให้ทอร์เรียนรู้ความดีงามและความเมตตา จึงได้จัดการส่งทอร์ลงมาจุติบนโลกมนุษย์ และลบความทรงจำของเขาในร่างของ Dr. Donald Blake นายแพทย์ผู้มีขาพิการ",
        Casting : "Chris Hemsworth",
        Movie : "Thor (2011) \nThor: The Dark World (2013) \nAvengers: Age of Ultron (2015) \nDoctor Strange (2016) \nThor: Ragnarok (2017) \nAvengers: Infinity War \nAvengers: Endgame"
    },
    {
        Name : "Hulk",
        Info : "ดร. บรูซ แบนเนอร์ เค้าคือนักนิวเคลียร์ฟิสิกส์ที่ได้ทำการทดลองสร้างระเบิดรังสีแกมม่าให้กับกระทรวงกลาโหมของสหรัฐ ณ ศูนย์วิจัยนิวเคลียร์ในรัฐนิวเม็กซิโก ระหว่างที่กำลังสาธิตอยู่นั้น ริค โจนส์ เด็กวัยรุ่นคนหนึ่งได้เข้าไปเตร็ดเตร่ในบริเวณที่ระเบิดเวลากำลังทำงาน บรูซรีบเข้าไปช่วยริคอย่างไม่ห่วงชีวิตตัวเอง ทำให้เขาต้องติดอยู่ในห้องทดลองเเละโดนระเบิดรังสีแกมม่าเข้าไปเต็มๆ แต่เขากลับรอดชีวิตมาได้อย่างปาฏิหาริย์",
        Casting : "mark ruffalo",
        Movie : "The Incredible Hulk (2008) \nMarvel's The Avengers (2012) \nAvengers: Age of Ultron (2015) \nThor: Ragnarok (2017) \nAvengers: Infinity War \nAvengers: Endgame"
    },
    {
        Name : "Ultron",
        Info : "อัลตรอนเกิดขึ้นจาก Dr Henry Hank Pym อัจฉริยะอันดับต้นๆของจักรวาลมาร์เวลที่ต้องการสร้างหุ่นยนต์เเอนดรอยด์ของตัวเอง เค้าจึงได้สร้างมันด้วยต้นเเบบกระบวนการคิดมาจากตัวของเค้าเอง ทำให้มันมีอารมณ์แบบมนุษย์ แต่สำหรับหุ่นยนตร์เเล้วมันไม่สามารถควบคุมอารมณ์ที่เเปรปรวนนี้ได้อย่างมนุษย์ มันจึงรู้สึกเกลียดชังมนุษย์รวมทั้งแฮงค์ที่เป็นผู้สร้างมัน จนเกิดเป็นเป้าหมายในการฆ่าล้างเผ่าพันธุ์มนุษยชาติ",
        Casting : "James Spader",
        Movie : "Avengers: Age of Ultron (2015)"
    },
    {
        Name : "Thanos",
        Info : "ธานอส มียีนส์ที่กลายพันธุ์ทำให้ผิดเขาเป็นสีม่วงและดูแตกต่างจากชาวไททั่นทั่วไป อีกทั้ง ธานอส ยังเป็นหลานของ โครนอส เทพแห่งเวลา ทำให้เขามีสายเลือดของผู้มีพลังสูงส่ง",
        Casting : "Josh Brolin",
        Movie : "Marvel's The Avengers (2012) \nAvengers: Infinity War \nAvengers: Endgame"
    },
    {
        Name : "Ego",
        Info : "Ego เป็นดาวเคราะห์ที่มีสติและความรู้สึก จุดกำเนิดของเขานั้นไม่มีใครแน่ใจว่าเป็นไปได้อย่างไร แต่ดูเหมือนดาวเคราะห์นี้จะเกืดสติขึ้นมาเอง แต่ก็มีผู้อ้างอิงว่าเขาเกิดขึ้นมาจากการรวมร่างผ่านการทดลองของนักวิทยาศาสตร์ชาวKree กับดาวที่กำลังจะระเบิดแต่ยังไงก็ตาม Ego ได้มีชีวิตขึ้นมา Ego มีความฉลาดระดับสูง แต่ตัวของเขาถูกสิ่งแวดล้อมต่างๆรบกวนได้ง่ายทำให้เขาต้องอยู่อาศัยอยู่ห่างไกลจากผู้คน และจะเกิดสติแตกทุกครั้งที่มีคนมารบกวนความสงบของเขาEgoสามารถควบคุมทุกส่วนของดาวเคราะห์ที่เป็นร่างกายเขาได้ ไม่ว่าจะเป็นสภาพอากาศ พืชและสถาพผิวดิน นอกจากนี้เขายังมีพลังจิตที่ใช้สื่อสาร อ่านความคิด และใช้ต่อสู้ได้ และสามารถดูดพลังจากดาวอื่นๆมาเสริมตัวเองได้ เขายังสามารถสร้างสิ่งมีชีวิตต่างๆที่ตัวเขาควบคุมได้เอง",
        Casting : "Kurt Russell",
        Movie : "Guardian of the Galaxy Vol.2 (2017)"
    }
]

module.exports.CharacterInfomations = CharacterInformations;